# Everything

波总，一个专注于收集和分享的神秘搬砖人。

---

- `A light heart can bear everything`

  所以今天推荐的软件就叫 `Everything`

---

​	大多数人办公应该用的Windows电脑吧，是不是经常会遗忘自己的文件在哪呢，Windows那蹩脚的 `搜索` 功能有木有被经常吐槽。

​	小编也是深受其害，一直就梦想着又一款软件，所念即所得，搜索文件搜啥出啥，巧了，就是一个不到50M的软件，满足了我所有的幻想，它就是 `【Everything】` 

![image-20210910163714450](https://i.loli.net/2021/09/10/dTR9ZVB5SbMlkeU.png)

​	Everything是voidtools开发的一款文件搜索工具，基于名称快速定位文件和文件夹。

​	它体积小巧，界面简洁易用，可快速建立索引，快速搜索，同时占用极低的系统资源，实时跟踪文件变化，并且还可以通过http或ftp形式分享搜索。

## Everything

![image-20210910163420661](https://i.loli.net/2021/09/10/pXTLlRjD3QbuFsC.png)

【特点】

- 快

​		要知道Everything以搜索12W+文件，只需1秒，备受用户推崇。

- 强

  `Everything` 不包含任何恶意、间谍软件或广告

  `Everything` 能在 Windows XP、Vista、Windows 7、Windows 8 和 Windows 10 上运行

  `Everything` 可以采用 布尔运算符 、通配符、 关键字等文件搜索常见的方法

  NTFS 索引功能需要 Everything 服务或用管理员方式打开 `Everything`

- 不安全

  安全隐患需要注意，一不小心你的隐私将暴露在网上。它提供一个名为HTTP的服务器功能，用户在本地或局域网上的其他电脑均可使用浏览器搜索，并支持文件下载。

  如果你稍不留神开启了该功能且没设密码，那么知道你电脑IP和端口的人就能轻松获取你电脑内的所有内容。

  `但是` 我既不是国家机密人员，也不是大明星。`So, who cares me?`

【下载】

下载地址：https://www.voidtools.com/zh-cn/

---

【下期预告】

下期会配套讲一下文件搜索的通用技巧，就没有编程基础的小伙伴们也能掌握的技能~

最近粉丝越来越多，希望我能一直坚持分享我的【Everything】





# 搜索



## 如何搜索文件或文件夹？

在搜索框中输入文件或文件夹部分名称，搜索结果将会立即出现。



## 如何使用布尔运算符？

**AND** 是默认布尔运算符。



例如，搜索 abc 和 123，您可以：

```
abc 123
```



搜索两个搜索项中任意一个，在两项中加上 | 。



例如，搜索 .jpg 或 .bmp，您可以：

```
.jpg | .bmp
```



搜索时排除某项，在其开头加上 ! 。



例如，搜索除了 abc 以外的内容，您可以：

```
!abc
```



查看 Everything 基础搜索语法：

- 在 ***"Everything"\*** 中，打开**帮助**菜单，点击**搜索语法**。



## 如何使用通配符？

搜索关键词中使用通配符 * 将会匹配任意数量的任意字符。

例如，搜索以 e 开头并以 g 结尾的文件和文件夹：e*g

搜索关键词中使用通配符 ? 将会匹配任一字符。

例如，搜索含有两个字符扩展名的文件：*.??



## 如何搜索包含空格的关键词？

搜索包含空格的关键词，请用双引号。

例如，搜索关键词 foo<space>bar："foo bar"



## 如何搜索文件类型？

搜索文件类型，请在搜索框输入扩展名，

例如，搜索 mp3 文件，输入 *.mp3 即可。

搜索多个文件类型，请使用 | 分隔，

例如：*.bmp|*.jpg 将会搜索 bmp 或 jpg 类型文件。



## 如何搜索指定位置的文件和文件夹？

搜索指定位置的文件和文件夹，请在搜索框中使用 \。

例如，在 downloads 文件夹中搜索全部 mp3 文件：downloads\ .mp3

您也可以在搜索菜单中启用匹配路径并包含路径到搜索关键词中。

例如，启用匹配路径并在 downloads 文件夹中搜索全部 avi 文件：downloads .avi